modified graphs
